Tekla Open API Reference for Tekla Structures 2025
Events Events
The Events type exposes the following members.
Events
Name | Description
DrawingChanged
 The DrawingChanged event is raised when the drawing has been changed and the database is committed.
DrawingDeleted
 The DrawingDeleted event is raised when a drawing has been deleted.
DrawingInserted
 The DrawingInserted event is raised when a drawing has been inserted.
DrawingReadyForIssuingChange
 The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.
DrawingStatusChanged
 The DrawingStatusChanged event is raised when the drawing status has changed.
DrawingUpdated
 The DrawingUpdated event is raised when the drawing has been inserted, deleted or modified, and the database is committed.
Top
See Also
Reference
Events Class
Tekla.Structures.Drawing Namespace